app/views/posts/show.html.haml

 #comments
  %h2=@post.comments.count
---
SELECT COUNT(*) FROM "comments"  WHERE "comments"."post_id" = ?  [["post_id", 4]]