app/controllers/ankets_controller.rb

SELECT  "ankets".* FROM "ankets"  WHERE "ankets"."id" = ? LIMIT 1  [["id", 0]]
---
def find_anket
    @post = Anket.find(params[:id])