app/controllers/comments_controller.rb

    def create
        @post = Post.find(params[:post_id])
        @comment = @post.comments.create(params[:comment].permit(:comment))
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "comments" ("comment", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["comment", "Thanks a lot :D"], ["created_at", "2016-07-25 13:28:32.154933"], ["post_id", 4], ["updated_at", "2016-07-25 13:28:32.154933"]]