app/controllers/posts_controller.rb

    def create
      @post = current_user.posts.build(post_params)

      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)